Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureVRepeat
The property labeled "V Repeat" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureURepeat
The property labeled "U Repeat" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureScaleLock
The property labeled "Scale Lock" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureRealWorldScaleY
The property labeled "Size Y" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureRealWorldScaleX
The property labeled "Size X" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureWAngle
The property labeled "Angle" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 360".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureOffsetLock
The property labeled "Offset Lock" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureRealWorldOffsetX
The property labeled "Offset X" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureLinkTextureTransforms
The property labeled "Link texture Transforms" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.UnifiedbitmapInvert
The property labeled "Invert Image" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.UnifiedbitmapRGBAmount
The property labeled "Brightness" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap.UnifiedbitmapBitmap
The property labeled "Source" from the "UnifiedBitmap" schema.
Remarks:
This property is of type "AssetPropertyString" and will contain a relative path.
Since:
2018

Autodesk.Revit.DB.Visual.UnifiedBitmap
Represents the properties of materials.
Since:
2018